# Brewfile - Declarative package management for Homebrew
# Install with: brew bundle install
# Update with: brew bundle dump --force --describe
# Cleanup unlisted packages: brew bundle cleanup

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "hashicorp/tap"

# ============================================
# Core Development Tools
# ============================================

# GitHub CLI - Official GitHub command-line tool
brew "gh"

# GNU Privacy Guard - Encryption and signing tool
brew "gnupg"

# Pinentry for macOS - Native passphrase entry dialog for GnuPG
brew "pinentry-mac"

# Version management (unified tool for all languages)
brew "mise"

# Infrastructure as Code
brew "hashicorp/tap/terraform"

# PostgreSQL C API library
brew "libpq"

# ============================================
# Modern CLI Replacements
# ============================================

# Modern replacement for 'ls' with colors and icons
brew "eza"

# Clone of cat with syntax highlighting
brew "bat"

# Simple, fast alternative to 'find'
brew "fd"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Command-line fuzzy finder
brew "fzf"

# Smarter cd command inspired by z and autojump
brew "zoxide"

# Simplified and community-driven man pages
brew "tldr"

# Lightweight and flexible command-line JSON processor
brew "jq"

# ============================================
# Shell & Terminal
# ============================================

# Cross-shell prompt written in Rust
brew "starship"

# Terminal multiplexer
brew "tmux"

# Fish-like autosuggestions for zsh
brew "zsh-autosuggestions"

# Fish shell-like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# ============================================
# System Libraries & Dependencies
# ============================================
# Note: Most system libraries are installed automatically as dependencies.
# Only list libraries you explicitly need for development.

# OpenSSL for secure communications
brew "openssl@3"

# Readline for interactive command line editing
brew "readline"

# ============================================
# GNU Stow - Symlink farm manager for dotfiles
# ============================================
brew "stow"

# ============================================
# GUI Applications
# ============================================

# Brave Browser - Privacy-focused web browser
cask "brave-browser"

# Docker Desktop - Containerization platform
cask "docker-desktop"

# Google Chrome web browser
cask "google-chrome"

# API development and testing tool
cask "postman"

# Team communication and collaboration
cask "slack"

# Visual Studio Code - Code editor
cask "visual-studio-code"
